In [ ]:
# grouping

import numpy as np 
import pandas as pd 

df = pd.DataFrame(
    {
        'A': ['foo', 'bar', 'foo','bar','foo', 'bar', 'foo', 'foo'],
        'B': ["one", "one", "two", "three", "two", "two", "one", "three"],
        'C': np.random.randn(8),        # generates 8 random floating point numbers
        'D': np.random.randn(8)
    }
)

In [2]:
df

     A      B         C         D
0  foo    one -0.703947 -1.536851
1  bar    one  1.304620 -0.172951
2  foo    two -1.312941 -0.038254
3  bar  three -0.384191  1.290917
4  foo    two  0.233394 -0.621457
5  bar    two  0.549436 -0.209487
6  foo    one -0.311308  1.190121
7  foo  three -0.200612 -0.906918

In [7]:
# grouping by a column label 

df.groupby('A')[['C', 'D']].sum()

            C         D
A
bar -3.240308  2.165950
foo -2.426374 -2.020654

In [8]:
# grouping by multiple columns label 

df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.441055 -0.146177
    three  0.412361  2.368988
    two   -2.211614 -0.056861
foo one   -2.821986 -2.644370
    three  0.778466  0.392266
    two   -0.382854  0.231450

In [ ]:
# creating a dataframe 

np.random.seed(42)      # sets the random number generator to a fixed starting point.

data = {
    'Date': pd.date_range('2024-01-01', periods=100, freq='D').tolist() * 2,
    'Category': np.random.choice(['Electronics', 'Clothing', 'Food', 'Books'], 200),
    'Region': np.random.choice(['North', 'South', 'East', 'West'], 200),
    'Product': np.random.choice(['Product_A', 'Product_B', 'Product_C', 'Product_D'], 200),
    'Sales': np.random.randint(100, 1000, 200),
    'Quantity': np.random.randint(1, 20, 200),
    'Profit': np.random.randint(10, 200, 200)
}

dataset = pd.DataFrame(data)

In [13]:
dataset

          Date     Category Region    Product  Sales  Quantity  Profit
0   2024-01-01         Food   East  Product_D    976         5     124
1   2024-01-02        Books   West  Product_D    983         3     120
2   2024-01-03  Electronics   East  Product_C    449        12     160
3   2024-01-04         Food  North  Product_A    146         4     192
4   2024-01-05         Food   West  Product_D    966        16      89
..         ...          ...    ...        ...    ...       ...     ...
195 2024-04-05     Clothing   West  Product_D    950         6      26
196 2024-04-06     Clothing   West  Product_A    605         2      18
197 2024-04-07        Books  South  Product_C    466        13     152
198 2024-04-08  Electronics   West  Product_D    243        11     161
199 2024-04-09         Food  North  Product_B    984        11      47

[200 rows x 7 columns]

In [14]:
dataset.head()

        Date     Category Region    Product  Sales  Quantity  Profit
0 2024-01-01         Food   East  Product_D    976         5     124
1 2024-01-02        Books   West  Product_D    983         3     120
2 2024-01-03  Electronics   East  Product_C    449        12     160
3 2024-01-04         Food  North  Product_A    146         4     192
4 2024-01-05         Food   West  Product_D    966        16      89

In [15]:
dataset.shape

(200, 7)

In [16]:
dataset.columns.tolist()

['Date', 'Category', 'Region', 'Product', 'Sales', 'Quantity', 'Profit']

In [17]:
# basic group by - single column 

# grouping by category and calculating the total sales 

dataset.groupby('Category')['Sales'].sum()

Category
Books          33810
Clothing       25791
Electronics    27322
Food           30478
Name: Sales, dtype: int32

In [18]:
# group by regiom and count number of transactions 

dataset.groupby('Region')['Sales'].count()

Region
East     50
North    49
South    40
West     61
Name: Sales, dtype: int64

In [19]:
# group by category and get mean sales 

dataset.groupby('Category')['Sales'].mean()

Category
Books          626.111111
Clothing       560.673913
Electronics    593.956522
Food           564.407407
Name: Sales, dtype: float64

In [20]:
# groupby with multiple aggregations using agg()

# multiple aggregations on single column 

dataset.groupby('Category')['Sales'].agg(['sum','mean', 'count', 'min', 'max'])

               sum        mean  count  min  max
Category
Books        33810  626.111111     54  115  995
Clothing     25791  560.673913     46  122  997
Electronics  27322  593.956522     46  111  925
Food         30478  564.407407     54  118  984

In [21]:
# multiple aggrgations on multiple columns 

dataset.groupby('Category').agg(
    {
        'Sales' : ['sum', 'mean'],
        'Quantity': ['sum', 'mean'],
        'Profit': ['sum', 'mean']
    }
)

             Sales             Quantity            Profit
               sum        mean      sum       mean    sum        mean
Category
Books        33810  626.111111      571  10.574074   5152   95.407407
Clothing     25791  560.673913      491  10.673913   4592   99.826087
Electronics  27322  593.956522      420   9.130435   4841  105.239130
Food         30478  564.407407      488   9.037037   5009   92.759259

In [22]:
# custom aggregatiom with rename 

dataset.groupby('Category').agg(
    Total_sales = ('Sales', 'sum'),
    Avg_sales = ('Sales', 'mean'),
    Total_quantity = ('Quantity', 'sum'),
    Max_Profit = ('Profit', 'max')
    )

             Total_sales   Avg_sales  Total_quantity  Max_Profit
Category
Books              33810  626.111111             571         189
Clothing           25791  560.673913             491         196
Electronics        27322  593.956522             420         199
Food               30478  564.407407             488         194

In [23]:
# multi level groupby 

dataset.groupby(['Category', 'Region'])['Sales'].sum()

Category     Region
Books        East       7271
             North      7893
             South      8103
             West      10543
Clothing     East       5209
             North      5795
             South      5351
             West       9436
Electronics  East       5874
             North      6567
             South      3205
             West      11676
Food         East      10563
             North      8022
             South      4552
             West       7341
Name: Sales, dtype: int32

In [24]:
# multi-level with multiple aggregations 

dataset.groupby(['Category', 'Region']).agg(
    {
        'Sales': 'sum',
        'Quantity': 'sum',
        'Profit': 'mean'
    }
)

                    Sales  Quantity      Profit
Category    Region
Books       East     7271       145   80.642857
            North    7893       130   97.615385
            South    8103       160   88.000000
            West    10543       136  113.200000
Clothing    East     5209       109  127.500000
            North    5795       139  110.181818
            South    5351        72  110.555556
            West     9436       171   69.375000
Electronics East     5874        81  113.333333
            North    6567       109   97.250000
            South    3205        57  111.857143
            West    11676       173  103.944444
Food        East    10563       145   89.647059
            North    8022       152  104.923077
            South    4552        84   76.166667
            West     7341       107  100.583333

In [25]:
# three level grouping 

dataset.groupby(['Category', 'Region', 'Product'])['Sales'].sum()

Category  Region  Product
Books     East    Product_A    1074
                  Product_B    1880
                  Product_C    2538
                  Product_D    1779
          North   Product_A    3344
                               ...
Food      South   Product_D    1393
          West    Product_A    2547
                  Product_B     253
                  Product_C     906
                  Product_D    3635
Name: Sales, Length: 61, dtype: int32

In [26]:
# group by date (time-based)

# ensure date is datetime 

dataset['Date'] = pd.to_datetime(dataset['Date'])

In [ ]:
# group by month 

dataset.groupby(dataset['Date'].dt.to_period('M'))['Sales'].sum()

# here .dt gives access to datetime specific methods

Date
2024-01    38108
2024-02    33233
2024-03    34935
2024-04    11125
Freq: M, Name: Sales, dtype: int32

In [31]:
# group by year and month 

dataset.groupby([dataset['Date'].dt.year, dataset['Date'].dt.month])['Sales'].sum()

Date  Date
2024  1       38108
      2       33233
      3       34935
      4       11125
Name: Sales, dtype: int32

In [32]:
# group by day of a week 

dataset.groupby(dataset['Date'].dt.day_name())['Sales'].sum()

Date
Friday       16165
Monday       21044
Saturday     14022
Sunday       17262
Thursday     17517
Tuesday      16293
Wednesday    15098
Name: Sales, dtype: int32

In [ ]:
# resample for time-series aggregations (Daily to weekly)

dataset.set_index('Date').resample('W')['Sales'].sum()

# here resample('W') resamples the time series into weekly intervals

Date
2024-01-07    10551
2024-01-14     8057
2024-01-21     7531
2024-01-28     8327
2024-02-04     8336
2024-02-11     8247
2024-02-18     8918
2024-02-25     7340
2024-03-03     6482
2024-03-10     7791
2024-03-17     8780
2024-03-24     7783
2024-03-31     8133
2024-04-07     9065
2024-04-14     2060
Freq: W-SUN, Name: Sales, dtype: int32

In [36]:
# calculating KPI's 

# KPI: Total Revenue, Average Transaction, Total Transactions

dataset.groupby('Category').agg(
Total_Revenue = ('Sales', 'sum'),
Average_Transaction = ('Sales', 'mean'),
Total_Transaction = ('Sales', 'count'),
Total_Items_Sold = ('Quantity', 'sum'),
Profit_Margin = ('Profit', 'mean')
)

,Total_Revenue,Average_Transaction,Total_Transaction,Total_Items_Sold,Profit_Margin
Category,,,,,
Books,33810,626.111111,54,571,95.407407
Clothing,25791,560.673913,46,491,99.826087
Electronics,27322,593.956522,46,420,105.239130
Food,30478,564.407407,54,488,92.759259

In [39]:
# KPI by region and country 

dataset.groupby(['Region', 'Category']).agg(
    Revenue = ('Sales', 'sum'),
    Transactions = ('Sales', 'count'),
    Average_sales = ('Sales', 'mean')
)

                    Revenue  Transactions  Average_sales
Region Category
East   Books           7271            14     519.357143
       Clothing        5209            10     520.900000
       Electronics     5874             9     652.666667
       Food           10563            17     621.352941
North  Books           7893            13     607.153846
       Clothing        5795            11     526.818182
       Electronics     6567            12     547.250000
       Food            8022            13     617.076923
South  Books           8103            12     675.250000
       Clothing        5351             9     594.555556
       Electronics     3205             7     457.857143
       Food            4552            12     379.333333
West   Books          10543            15     702.866667
       Clothing        9436            16     589.750000
       Electronics    11676            18     648.666667
       Food            7341            12     611.750000

In [44]:
# filter groups with sum > 10000

dataset.groupby('Category').filter(lambda x: x['Sales'].sum() > 10000)

          Date     Category Region    Product  Sales  Quantity  Profit
0   2024-01-01         Food   East  Product_D    976         5     124
1   2024-01-02        Books   West  Product_D    983         3     120
2   2024-01-03  Electronics   East  Product_C    449        12     160
3   2024-01-04         Food  North  Product_A    146         4     192
4   2024-01-05         Food   West  Product_D    966        16      89
..         ...          ...    ...        ...    ...       ...     ...
195 2024-04-05     Clothing   West  Product_D    950         6      26
196 2024-04-06     Clothing   West  Product_A    605         2      18
197 2024-04-07        Books  South  Product_C    466        13     152
198 2024-04-08  Electronics   West  Product_D    243        11     161
199 2024-04-09         Food  North  Product_B    984        11      47

[200 rows x 7 columns]

In [45]:
# get top two categories by sales

dataset.groupby('Category')['Sales'].sum().nlargest(2)

Category
Books    33810
Food     30478
Name: Sales, dtype: int32

In [46]:
# transform (apply function but keep the original shape)

#add column with category average 
dataset['Category_Average_Sales']= dataset.groupby('Category')['Sales'].transform('mean')

In [48]:
# checking columns 

dataset.columns

Index(['Date', 'Category', 'Region', 'Product', 'Sales', 'Quantity', 'Profit',
       'Category_Average_Sales'],
      dtype='object')

In [49]:
# Exercise 1: Find total sales by Category and Region

dataset.groupby(['Category', 'Region'])['Sales'].sum()

Category     Region
Books        East       7271
             North      7893
             South      8103
             West      10543
Clothing     East       5209
             North      5795
             South      5351
             West       9436
Electronics  East       5874
             North      6567
             South      3205
             West      11676
Food         East      10563
             North      8022
             South      4552
             West       7341
Name: Sales, dtype: int32

In [53]:
# Exercise 2: Calculate average profit per product

dataset.groupby('Product')['Profit'].mean().round(2)

Product
Product_A     96.77
Product_B    103.79
Product_C     88.45
Product_D    100.52
Name: Profit, dtype: float64

In [55]:
# Exercise 3: Find the category with highest total sales

dataset.groupby('Category')['Sales'].sum().nlargest(1)

Category
Books    33810
Name: Sales, dtype: int32

In [56]:
dataset.columns

Index(['Date', 'Category', 'Region', 'Product', 'Sales', 'Quantity', 'Profit',
       'Category_Average_Sales'],
      dtype='object')

In [58]:
# Exercise 4: Group by month and calculate total sales and quantity

df['Date'] = pd.to_datetime(dataset['Date'])

dataset.groupby(df['Date'].dt.to_period('M')).agg(
    { 
    'Sales' : 'sum',
    'Quantity' : 'sum'
    }
)

         Sales  Quantity
Date
2024-01   6116        70

In [59]:
# Exercise 5: Create a KPI dashboard by Region

dataset.groupby('Region').agg(
    Total_Revenue = ('Sales', 'sum'),
    Average_transaction_value = ('Sales', 'mean'),
    Number_of_transaction = ('Sales', 'count'),
    Total_quantity_sold = ('Quantity', 'sum'),
    Average_Profit = ('Profit', 'mean'),
    Total_Profit = ('Profit', 'sum')
)

,Total_Revenue,Average_transaction_value,Number_of_transaction,Total_quantity_sold,Average_Profit,Total_Profit
Region,,,,,,
East,28917,578.340000,50,480,98.960000,4948
North,28277,577.081633,49,530,102.285714,5012
South,21211,530.275000,40,373,93.700000,3748
West,38996,639.278689,61,587,96.491803,5886

In [72]:
# Exercise 6: Find which Product in each Category has the highest sales

product_Sales = dataset.groupby(['Category', 'Product'])['Sales'].sum()

product_Sales.groupby('Category').idxmax()      #idmax finds the highest value in a series and returns the name/label, not the value

Category
Books                (Books, Product_D)
Clothing          (Clothing, Product_A)
Electronics    (Electronics, Product_B)
Food                  (Food, Product_D)
Name: Sales, dtype: object

In [65]:
# Exercise 7: Calculate sales growth rate month-over-month

monthly_sales = dataset.set_index('Date').resample('ME')['Sales'].sum()

growth_rate = monthly_sales.pct_change() * 100

growth_rate.round(2)

Date
2024-01-31      NaN
2024-02-29   -12.79
2024-03-31     5.12
2024-04-30   -68.16
Freq: ME, Name: Sales, dtype: float64